In [1]:
import numpy as np
import pandas as pd

In [7]:
df = pd.read_csv('top 100 streamed songs.csv')
df.head(1)

,id,name,duration,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,danceability
0,4ZtFanR9U6ndgddUvNcjcG,Good 4 U Olivia Rodrigo,2.97,0.664,9,-5.044,1,0.154,0.335,0.0,0.0849,0.688,166.928,0.563

In [10]:
x=pd.DataFrame()
print(x)

Empty DataFrame
Columns: []
Index: []

In [12]:
x = ['pro','jay']
print(pd.DataFrame(x))

     0
0  pro
1  jay

In [17]:
x = {
    "name":["pro","jay","sankat"],
     "num":[9,8,7]
    }
print(pd.DataFrame(x))

     name  num
0     pro    9
1     jay    8
2  sankat    7

In [35]:
print(pd.DataFrame(x["name"]))

        0
0     pro
1     jay
2  sankat

In [37]:
#addition of column
x["add"] = pd.Series(["m","m","m"],index=[6,7,8])
print(x)

{'name': ['pro', 'jay', 'sankat'], 'num': [9, 8, 7], 'add': 6    m
7    m
8    m
dtype: object}

In [38]:
x = pd.DataFrame(x)

In [39]:
x

     name  num add
6     pro    9   m
7     jay    8   m
8  sankat    7   m

In [40]:
del x["num"]
x

     name add
6     pro   m
7     jay   m
8  sankat   m

In [41]:
x.pop("add")

6    m
7    m
8    m
Name: add, dtype: object

In [42]:
x

     name
6     pro
7     jay
8  sankat

In [43]:
x["name"][8]="Sanket"

In [44]:
x

     name
6     pro
7     jay
8  Sanket

In [67]:

info = {'one' : pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e']),   
   'two' : pd.Series([1, 2, 3, 4, 5, 6], index=[4,5,6,7,8,9])}
y=pd.DataFrame(info)
y

   one  two
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
d  4.0  NaN
e  5.0  NaN
4  NaN  1.0
5  NaN  2.0
6  NaN  3.0
7  NaN  4.0
8  NaN  5.0
9  NaN  6.0

In [68]:
y.loc["c"]

one    3.0
two    NaN
Name: c, dtype: float64

In [69]:
y.iloc[4]

one    5.0
two    NaN
Name: e, dtype: float64

In [70]:
y[2:6]

   one  two
c  3.0  NaN
d  4.0  NaN
e  5.0  NaN
4  NaN  1.0

In [71]:

y[:]

   one  two
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
d  4.0  NaN
e  5.0  NaN
4  NaN  1.0
5  NaN  2.0
6  NaN  3.0
7  NaN  4.0
8  NaN  5.0
9  NaN  6.0

In [74]:
#addition of row
y1=pd.DataFrame([[1,"what"]],columns=["one","two"])
y.append(y1)

   one   two
a  1.0   NaN
b  2.0   NaN
c  3.0   NaN
d  4.0   NaN
e  5.0   NaN
4  NaN     1
5  NaN     2
6  NaN     3
7  NaN     4
8  NaN     5
9  NaN     6
0  1.0  what